Public Attributes | List of all members
API_Component3D Union Reference
ModelAccess API
General representation of a 3D component. More...
#include <APIdefs_3D.h>
 Public Attributes
API_3D_Head  | header
The common header which specify the type and database index of the given component.
API_BodyType  | body
Parameters of a body type component.
API_PgonType  | pgon
Parameters of a polygon type component.
API_PedgType  | pedg
Edge reference. Negative value means opposite direction, zero index identifies a new hole in a polygon.
API_EdgeType  | edge
Parameters of an edge type component.
API_VertType  | vert
Parameters of a vertex.
API_VectType  | vect
Parameters of a vector type component.
API_LghtType  | lght
Parameters of a light type component.
API_UmatType  | umat
Parameters of a surface material.
Detailed Description
General representation of a 3D component.
Remarks
This structure is used to work with 3D components of the actual database. The definition of a 3D component is described in this structure, which is in fact a union of all component types. Before you try to understand how the 3D model corresponds to the API structures, please read carefully the Primitive Elements chapter in the GDL Reference Manual. The 3D geometry itself is described by the API_PgonType, API_PedgType, API_EdgeType, API_VertType and API_VectType structures. Negative index referring to an edge or a normal vector indicates that the component should be interpreted reversed. In this case require the component using the absolute value of the index, but consider the edge directing from the second vertex to the first one, or when retrieving a normal vector, invert its coordinates. The 3D representation also owns a common pool of the surface materials. The polygon instances of the geometry description refer to these materials by indices. One surface definition is described by the API_UmatType structure. Surface materials may come from two sources. The list of materials contains all the global material attributes which are referenced by any polygon of the 3D geometry. Materials may be defined in GDL scripts also. Elements placed with the light tool on the floorplan may contain light emissions, defined via GDL scripts. All of the light sources present in the 3D geometry are described with the API_LghtType structure.
Member Data Documentation
◆ body
 API_Component3D::body
Parameters of a body type component.
◆ edge
 API_Component3D::edge
Parameters of an edge type component.
◆ header
 API_Component3D::header
The common header which specify the type and database index of the given component.
◆ lght
 API_Component3D::lght
Parameters of a light type component.
◆ pedg
 API_Component3D::pedg
Edge reference. Negative value means opposite direction, zero index identifies a new hole in a polygon.
◆ pgon
 API_Component3D::pgon
Parameters of a polygon type component.
◆ umat
 API_Component3D::umat
Parameters of a surface material.
◆ vect
 API_Component3D::vect
Parameters of a vector type component.
◆ vert
 API_Component3D::vert
Parameters of a vertex.